Revit 2026 API

# ExportPatternKeyOriginalFillPatternName Property

---

The original FillPattern name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string OriginalFillPatternName { get; set; }
```
```vb
Public Property OriginalFillPatternName As String
	Get
	Set
```
```cpp
public:
property String^ OriginalFillPatternName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member OriginalFillPatternName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportPatternKey Class

Autodesk.Revit.DB Namespace